In [1]:
from __future__ import division
from pandas import Series, DataFrame
import pandas as pd
from numpy.random import randn
import numpy as np
pd.options.display.max_rows = 12
np.set_printoptions(precision=4, suppress=True)

In [2]:
%matplotlib inline
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(12, 4))

In [4]:
close_px = pd.read_csv('stock_px.csv', parse_dates=True, index_col=0)
volume = pd.read_csv('volume.csv', parse_dates=True, index_col=0)
prices = close_px.ix['2011-09-05':'2011-09-14', ['AAPL', 'JNJ', 'SPX', 'XOM']]
volume = volume.ix['2011-09-05':'2011-09-12', ['AAPL', 'JNJ', 'XOM']]

In [5]:
prices

              AAPL    JNJ      SPX    XOM
2011-09-06  379.74  64.64  1165.24  71.15
2011-09-07  383.93  65.43  1198.62  73.65
2011-09-08  384.14  64.95  1185.90  72.82
2011-09-09  377.48  63.64  1154.23  71.01
2011-09-12  379.94  63.59  1162.27  71.84
2011-09-13  384.62  63.61  1172.87  71.65
2011-09-14  389.30  63.73  1188.68  72.64

In [6]:
volume

                AAPL       JNJ       XOM
2011-09-06  18173500  15848300  25416300
2011-09-07  12492000  10759700  23108400
2011-09-08  14839800  15551500  22434800
2011-09-09  20171900  17008200  27969100
2011-09-12  16697300  13448200  26205800

In [7]:
prices * volume

                  AAPL         JNJ  SPX         XOM
2011-09-06  6901204890  1024434112  NaN  1808369745
2011-09-07  4796053560   704007171  NaN  1701933660
2011-09-08  5700560772  1010069925  NaN  1633702136
2011-09-09  7614488812  1082401848  NaN  1986085791
2011-09-12  6343972162   855171038  NaN  1882624672
2011-09-13         NaN         NaN  NaN         NaN
2011-09-14         NaN         NaN  NaN         NaN

In [8]:
vwap = (prices * volume).sum() / volume.sum()
vwap

AAPL    380.655181
JNJ      64.394769
SPX            NaN
XOM      72.024288
dtype: float64

In [9]:
vwap.dropna()

AAPL    380.655181
JNJ      64.394769
XOM      72.024288
dtype: float64

In [12]:
prices.align(volume,join='outer')

(              AAPL    JNJ      SPX    XOM
 2011-09-06  379.74  64.64  1165.24  71.15
 2011-09-07  383.93  65.43  1198.62  73.65
 2011-09-08  384.14  64.95  1185.90  72.82
 2011-09-09  377.48  63.64  1154.23  71.01
 2011-09-12  379.94  63.59  1162.27  71.84
 2011-09-13  384.62  63.61  1172.87  71.65
 2011-09-14  389.30  63.73  1188.68  72.64,
                 AAPL       JNJ  SPX       XOM
 2011-09-06  18173500  15848300  NaN  25416300
 2011-09-07  12492000  10759700  NaN  23108400
 2011-09-08  14839800  15551500  NaN  22434800
 2011-09-09  20171900  17008200  NaN  27969100
 2011-09-12  16697300  13448200  NaN  26205800
 2011-09-13       NaN       NaN  NaN       NaN
 2011-09-14       NaN       NaN  NaN       NaN)

In [15]:
s1 = Series(range(3),index=list('abc'))
s2 = Series(range(4),index=list('dbce'))
s3 = Series(range(3),index=list('fac'))
DataFrame({'one':s1,'two':s2,'three':s3})

   one  three  two
a    0      1  NaN
b    1    NaN    1
c    2      2    2
d  NaN    NaN    0
e  NaN    NaN    3
f  NaN      0  NaN

In [16]:
DataFrame({'one':s1,'two':s2,'three':s3},index=list('face'))

   one  three  two
f  NaN      0  NaN
a    0      1  NaN
c    2      2    2
e  NaN    NaN    3

In [17]:
ts1 = Series(np.random.randn(3),index=pd.date_range('2012-6-13',periods=3,freq='W-WED'))
ts1

2012-06-13    0.197903
2012-06-20    0.427580
2012-06-27   -1.738838
Freq: W-WED, dtype: float64

In [18]:
ts1.resample('B')

2012-06-13    0.197903
2012-06-14         NaN
2012-06-15         NaN
2012-06-18         NaN
2012-06-19         NaN
2012-06-20    0.427580
2012-06-21         NaN
2012-06-22         NaN
2012-06-25         NaN
2012-06-26         NaN
2012-06-27   -1.738838
Freq: B, dtype: float64

In [19]:
ts1.resample('B',fill_method='ffill')

2012-06-13    0.197903
2012-06-14    0.197903
2012-06-15    0.197903
2012-06-18    0.197903
2012-06-19    0.197903
2012-06-20    0.427580
2012-06-21    0.427580
2012-06-22    0.427580
2012-06-25    0.427580
2012-06-26    0.427580
2012-06-27   -1.738838
Freq: B, dtype: float64

In [20]:
dates = pd.DatetimeIndex(['2012-6-12', '2012-6-17', '2012-6-18',
                          '2012-6-21', '2012-6-22', '2012-6-29'])

In [21]:
ts2 = Series(np.random.randn(6),index=dates)
ts2

2012-06-12   -0.710203
2012-06-17    1.242749
2012-06-18    0.439437
2012-06-21    1.549667
2012-06-22    1.083019
2012-06-29   -0.517330
dtype: float64

In [22]:
ts1.reindex(ts2.index,method='ffill')

2012-06-12         NaN
2012-06-17    0.197903
2012-06-18    0.197903
2012-06-21    0.427580
2012-06-22    0.427580
2012-06-29   -1.738838
dtype: float64

In [23]:
ts2 + ts1.reindex(ts2.index,method='ffill')

2012-06-12         NaN
2012-06-17    1.440652
2012-06-18    0.637339
2012-06-21    1.977247
2012-06-22    1.510599
2012-06-29   -2.256167
dtype: float64

In [24]:
gdp = Series([1.78,1.94,2.08,2.01,2.15,2.31,2.46],
                         index=pd.period_range('1984Q2',periods=7,freq='Q-SEP'))
infl = Series([0.025, 0.045, 0.037, 0.04],
              index=pd.period_range('1982', periods=4, freq='A-DEC'))
gdp

1984Q2    1.78
1984Q3    1.94
1984Q4    2.08
1985Q1    2.01
1985Q2    2.15
1985Q3    2.31
1985Q4    2.46
Freq: Q-SEP, dtype: float64

In [25]:
infl

1982    0.025
1983    0.045
1984    0.037
1985    0.040
Freq: A-DEC, dtype: float64

In [26]:
infl_q = infl.asfreq('Q-SEP',how='end')
infl_q

1983Q1    0.025
1984Q1    0.045
1985Q1    0.037
1986Q1    0.040
Freq: Q-SEP, dtype: float64

In [27]:
infl_q.reindex(gdp.index,method='ffill')

1984Q2    0.045
1984Q3    0.045
1984Q4    0.045
1985Q1    0.037
1985Q2    0.037
1985Q3    0.037
1985Q4    0.037
Freq: Q-SEP, dtype: float64

In [34]:
rng = pd.date_range('2012-06-01 09:30','2012-06-06 15:59',freq='T')
rng

DatetimeIndex(['2012-06-01 09:30:00', '2012-06-01 09:31:00',
               '2012-06-01 09:32:00', '2012-06-01 09:33:00',
               '2012-06-01 09:34:00', '2012-06-01 09:35:00',
               '2012-06-01 09:36:00', '2012-06-01 09:37:00',
               '2012-06-01 09:38:00', '2012-06-01 09:39:00',
               ...
               '2012-06-06 15:50:00', '2012-06-06 15:51:00',
               '2012-06-06 15:52:00', '2012-06-06 15:53:00',
               '2012-06-06 15:54:00', '2012-06-06 15:55:00',
               '2012-06-06 15:56:00', '2012-06-06 15:57:00',
               '2012-06-06 15:58:00', '2012-06-06 15:59:00'],
              dtype='datetime64[ns]', length=7590, freq='T')

In [35]:
ts = Series(np.arange(len(rng),dtype=float),index=rng)
ts

2012-06-01 09:30:00       0
2012-06-01 09:31:00       1
2012-06-01 09:32:00       2
2012-06-01 09:33:00       3
2012-06-01 09:34:00       4
2012-06-01 09:35:00       5
                       ...
2012-06-06 15:54:00    7584
2012-06-06 15:55:00    7585
2012-06-06 15:56:00    7586
2012-06-06 15:57:00    7587
2012-06-06 15:58:00    7588
2012-06-06 15:59:00    7589
Freq: T, dtype: float64

In [36]:
from datetime import time

In [37]:
ts[time(10,0)]

2012-06-01 10:00:00      30
2012-06-02 10:00:00    1470
2012-06-03 10:00:00    2910
2012-06-04 10:00:00    4350
2012-06-05 10:00:00    5790
2012-06-06 10:00:00    7230
Freq: 1440T, dtype: float64

In [38]:
ts.at_time(time(10,0))

2012-06-01 10:00:00      30
2012-06-02 10:00:00    1470
2012-06-03 10:00:00    2910
2012-06-04 10:00:00    4350
2012-06-05 10:00:00    5790
2012-06-06 10:00:00    7230
Freq: 1440T, dtype: float64

In [39]:
ts.between_time(time(10,0),time(10,1))

2012-06-01 10:00:00      30
2012-06-01 10:01:00      31
2012-06-02 10:00:00    1470
2012-06-02 10:01:00    1471
2012-06-03 10:00:00    2910
2012-06-03 10:01:00    2911
2012-06-04 10:00:00    4350
2012-06-04 10:01:00    4351
2012-06-05 10:00:00    5790
2012-06-05 10:01:00    5791
2012-06-06 10:00:00    7230
2012-06-06 10:01:00    7231
dtype: float64

In [40]:
indexer = np.sort(np.random.permutation(len(ts))[700:])

In [44]:
irr_ts = ts.copy()

In [45]:
irr_ts[indexer] = np.nan

In [46]:
irr_ts['2012-06-01 09:50':'2012-06-01 10:00']

2012-06-01 09:50:00   NaN
2012-06-01 09:51:00   NaN
2012-06-01 09:52:00    22
2012-06-01 09:53:00   NaN
2012-06-01 09:54:00   NaN
2012-06-01 09:55:00    25
2012-06-01 09:56:00    26
2012-06-01 09:57:00   NaN
2012-06-01 09:58:00   NaN
2012-06-01 09:59:00   NaN
2012-06-01 10:00:00   NaN
Freq: T, dtype: float64

In [47]:
selection = pd.date_range('2012-06-01 10:00',periods=4,freq='B')
irr_ts.asof(selection)

2012-06-01 10:00:00      26
2012-06-04 10:00:00    4341
2012-06-05 10:00:00    5790
2012-06-06 10:00:00    7229
Freq: B, dtype: float64

In [48]:
selection

DatetimeIndex(['2012-06-01 10:00:00', '2012-06-04 10:00:00',
               '2012-06-05 10:00:00', '2012-06-06 10:00:00'],
              dtype='datetime64[ns]', freq='B')

In [50]:
data1 = DataFrame(np.ones((6,3),dtype=float),columns=list('abc'),
                                   index=pd.date_range('6/12/2012',periods=6))
data2 = DataFrame(np.ones((6,3),dtype=float)*2,columns=list('abc'),
                                   index=pd.date_range('6/13/2012',periods=6))

In [54]:
spliced = pd.concat([data1.ix[:'2012-06-14'],data2.ix['2012-06-15':]])
spliced

            a  b  c
2012-06-12  1  1  1
2012-06-13  1  1  1
2012-06-14  1  1  1
2012-06-15  2  2  2
2012-06-16  2  2  2
2012-06-17  2  2  2
2012-06-18  2  2  2

In [56]:
data2 = DataFrame(np.ones((6,4),dtype=float)*2,
                                    columns=list('abcd'),index=pd.date_range('6/13/2012',periods=6))
data2

            a  b  c  d
2012-06-13  2  2  2  2
2012-06-14  2  2  2  2
2012-06-15  2  2  2  2
2012-06-16  2  2  2  2
2012-06-17  2  2  2  2
2012-06-18  2  2  2  2

In [57]:
spliced = pd.concat([data1.ix[:'2012-06-14'],data2.ix['2012-06-15':]])
spliced

            a  b  c   d
2012-06-12  1  1  1 NaN
2012-06-13  1  1  1 NaN
2012-06-14  1  1  1 NaN
2012-06-15  2  2  2   2
2012-06-16  2  2  2   2
2012-06-17  2  2  2   2
2012-06-18  2  2  2   2

In [58]:
spliced_filled = spliced.combine_first(data2)
spliced_filled

            a  b  c   d
2012-06-12  1  1  1 NaN
2012-06-13  1  1  1   2
2012-06-14  1  1  1   2
2012-06-15  2  2  2   2
2012-06-16  2  2  2   2
2012-06-17  2  2  2   2
2012-06-18  2  2  2   2

In [60]:
spliced.update(data2,overwrite=False)
spliced

            a  b  c   d
2012-06-12  1  1  1 NaN
2012-06-13  1  1  1   2
2012-06-14  1  1  1   2
2012-06-15  2  2  2   2
2012-06-16  2  2  2   2
2012-06-17  2  2  2   2
2012-06-18  2  2  2   2

In [61]:
cp_spliced = spliced.copy()

In [62]:
cp_spliced[['a','c']] = data1[['a','c']]
cp_spliced

             a  b   c   d
2012-06-12   1  1   1 NaN
2012-06-13   1  1   1   2
2012-06-14   1  1   1   2
2012-06-15   1  2   1   2
2012-06-16   1  2   1   2
2012-06-17   1  2   1   2
2012-06-18 NaN  2 NaN   2

In [63]:
import pandas.io.data as web

/Users/keeeeei/.pyenv/versions/anaconda3-2.5.0/lib/python3.5/site-packages/pandas/io/data.py:33: FutureWarning:
The pandas.io.data module is moved to a separate package (pandas-datareader) and will be removed from pandas in a future version.
After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.
  FutureWarning)

In [67]:
price = web.get_data_yahoo('AAPL', '2011-01-01')['Adj Close']

In [68]:
price[-5:]

Date
2016-08-29    106.820000
2016-08-30    106.000000
2016-08-31    106.099998
2016-09-01    106.730003
2016-09-02    107.730003
Name: Adj Close, dtype: float64

In [69]:
price['2011-10-03'] / price['2011-3-01'] -1

0.072399887545477881

In [70]:
returns = price.pct_change()

In [71]:
ret_index = (1+returns).cumprod()

In [74]:
ret_index[0] = 1

In [75]:
ret_index

Date
2011-01-03    1.000000
2011-01-04    1.005219
2011-01-05    1.013442
2011-01-06    1.012622
2011-01-07    1.019874
2011-01-10    1.039081
                ...
2016-08-26    2.480962
2016-08-29    2.478178
2016-08-30    2.459155
2016-08-31    2.461475
2016-09-01    2.476090
2016-09-02    2.499290
Name: Adj Close, dtype: float64

In [76]:
m_returns = ret_index.resample('BM',how='last').pct_change()
m_returns['2012']

Date
2012-01-31    0.127111
2012-02-29    0.188311
2012-03-30    0.105283
2012-04-30   -0.025970
2012-05-31   -0.010702
2012-06-29    0.010853
2012-07-31    0.045822
2012-08-31    0.093877
2012-09-28    0.002796
2012-10-31   -0.107600
2012-11-30   -0.012375
2012-12-31   -0.090743
Freq: BM, Name: Adj Close, dtype: float64

In [77]:
m_rets = (1+returns).resample('M',how='prod',kind='period') -1
m_rets['2012']

Date
2012-01    0.127111
2012-02    0.188311
2012-03    0.105283
2012-04   -0.025970
2012-05   -0.010702
2012-06    0.010853
2012-07    0.045822
2012-08    0.093877
2012-09    0.002796
2012-10   -0.107600
2012-11   -0.012375
2012-12   -0.090743
Freq: M, Name: Adj Close, dtype: float64